
export default {
    data() {
        return {
            level: {
                1: '国家级重大',
                2: '国家级重点',
                3: '国家级一般',
                4: '省部级重大',
                5: '省部级规划重点',
                6: '省部级重点',
                7: '省部级规划一般',
                8: '省部级一般',
                9: '厅局级重大',
                10: '厅局级重点',
                11: '厅局级一般',
                12: '其他计划项目',
                13: '横向',
                14: '其他',
                15: '省部级面上重点'
            },
            awardLevel: {
                1: '国家级',
                2: '省部级',
                3: '厅局级',
                4: '社会力量',
                5: '其他'
            },
            paperType: {
                1: '顶级',
                2: '特级',
                3: 'SCI一档',
                4: 'SCI二档',
                5: 'SCI三档',
                6: 'SCI四档',
                7: 'EI期刊',
                8: 'EI会议',
                9: 'CPCS-S',
                10: 'SSCI',
                11: 'A_HCI',
                12: 'CPCS-SSH',
                13: 'CSSCI',
                14: 'CSCD',
                15: 'SCD',
                16: '一级A',
                17: '一级B',
                18: '二级',
                19: '其他',
                20: 'SCI',
                21: '一级'
            },
            awardType: {
                1: '科研获奖',
                2: '知识产权',
                3: '标准',
                4: '批示、采纳',
                5: '艺术展'
            }
        }
    }
}
